Revit 2026 API

# CityTimeZone Property

---

Time-zone in which the city resides

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public double TimeZone { get; }
```
```vb
Public ReadOnly Property TimeZone As Double
	Get
```
```cpp
public:
property double TimeZone {
	double get ();
}
```
```fsharp
member TimeZone : float with get
```

#### Property Value

Double

A read only property that returns the time zone in which the city resides. The value is in hours, ranging from +12 hours to -12 hours with 0 being GMT.

#### Reference

City Class

Autodesk.Revit.DB Namespace